<?php

session_start();


/*
|--------------------------------------------------------------------------
| Vider toutes les variables de session
|--------------------------------------------------------------------------
*/

$_SESSION = [];


/*
|--------------------------------------------------------------------------
| Détruire le cookie de session
|--------------------------------------------------------------------------
*/

if (ini_get("session.use_cookies")) {

    $parametres = session_get_cookie_params();

    setcookie(
        session_name(),
        '',
        time() - 42000,
        $parametres["path"],
        $parametres["domain"],
        $parametres["secure"],
        $parametres["httponly"]
    );
}


/*
|--------------------------------------------------------------------------
| Détruire la session
|--------------------------------------------------------------------------
*/

session_destroy();


/*
|--------------------------------------------------------------------------
| Retour à la connexion
|--------------------------------------------------------------------------
*/

header("Location: connexion.php");
exit;